<script>
    import Header from "../Header.svelte";
    import Footer from "../Footer.svelte";
	// Создаем массив с федеральными мерами поддержки и их краткими описаниями.
	const measures = [
		{
			title: 'Налоговые льготы: ставка в размере 0% при применении УСН на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере установлена ставка (0%) по упрощенной системе налогообложения."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 1% при применении УСН с объектом налогообложения доходы на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере на 2022-2024 годы установлена пониженная ставка (1%) по упрощенной системе налогообложения с объектом налогообложения 'доходы' для субъектов малого предпринимательства и индивидуальных предпринимателей."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 4% при применении УСН с объектом налогообложения доходы на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере на 2023-2024 годы установлена пониженная ставка (4%) по упрощенной системе налогообложения с объектом налогообложения 'доходы' для субъектов малого предпринимательства и индивидуальных предпринимателей."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 0% при применении патентной системы налогообложения на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере установлена ставка (0%) ппри применении патентной системы налогообложения."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 5% при применении УСН с объектом налогообложения доходы, уменьшенные на величину расходов, на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы на 2019-2024 годы установлена пониженная ставка (5%) по упрощенной системе налогообложения с объектом налогообложения «доходы, уменьшенные на величину расходов» для субъектов малого предпринимательства и индивидуальных предпринимателей."
		},
		{
			title:
				'Предоставление социальных выплат отдельным категориям граждан на обеспечение жилыми помещениями в ХМАО – Югре',
			description:
				"Социальные выплаты предоставляются работникам организаций, являющихся субъектами малого и среднего предпринимательства, или индивидуальным предпринимателям, зарегистрированным в автономном округе, осуществляющим деятельность в области информационных технологий, компьютерного программного обеспечения и (или) участвующим в реализации проекта «Цифровая платформа Югры» по направлениям: медицина, жилищно-коммунальное хозяйство, государственное управление, создание искусственного интеллекта, а также медицинским работникам медицинских организаций первичного звена здравоохранения и скорой медицинской помощи, медицинским работникам организаций социального обслуживания, научным работникам научных организаций и организаций высшего образования, работникам организаций высшего образования из числа профессорско-преподавательского состава, имеющим ученую степень кандидата и (или) доктора наук."
		},
		{
			title: 'Инвестиционный налоговый вычет',
			description:
				"Введен инвестиционный налоговый вычет в размере 70% для телекоммуникационных компаний.  Таким образом им вернут часть налога на прибыль. Это поможет сохранить качество связи, не привлекая дополнительного финансирования, а также сохранит инвестиции операторов в эксплуатацию и модернизацию сетей связи."
		},
		{
			title: 'Снижение ставки арендной платы',
			description:
				"В 2 раза снижена ставка арендной платы по договорам аренды имущества, находящегося в государственной собственности автономного округа для объектов связи и центров обработки данных."
		},
		{
			title: 'Сумма налога на имущество уменьшается на 50%',
			description:
				"Сумма налога на имущество уменьшается на 50% для организаций, осуществляющих деятельность в области информационных технологий, начиная с отчетного периода получения документа о государственной аккредитации организации, осуществляющей деятельность в области информационных технологий, в отношении объектов связи и центров обработки данных."
		},
		{
			title: 'Конкурс на получение Грантов Губернатора ХМАО – Югры',
			description:
				"Ежегодно проводится конкурс на получение грантов Губернатора Ханты-Мансийского автономного округа – Югры на развитие гражданского общества и реализацию проектов в области культуры, искусства и креативных индустрий в направлении проектов в сфере ИКТ."
		}
	];
</script>
<Header/>
<h1>Региональные меры поддержки в сфере IT</h1>
<div class="container">
	{#each measures as measure}
		<div class="measure">
			<h2>{measure.title}</h2>
			<p>{measure.description}</p>
		</div>
	{/each}
</div>
<Footer/>

<style>
	 .container {
    max-width: 1200px; /* Максимальная ширина контейнера */
    margin: 0 auto; /* Центрирование контейнера */
    padding: 30px 20px; /* Отступ для контейнера */
    display: grid; /* Используем сетку */
    grid-template-columns: repeat(4, 1fr); /* 4 равные колонки */
    gap: 20px; /* Промежутки между элементами */
    border-radius: 10px; /* Закругления контейнера */
    background-color: #ffffff; /* Фон контейнера */
    box-shadow: 0 4px 20px rgba(0, 0, 0, 0.1); /* Тень для контейнера */
  }

  h1 {
    text-align: center;
    margin-bottom: 30px;
    font-size: 2em; /* Увеличенный размер */
    font-weight: bold; /* Полужирное начертание заголовка */
    color: #ffffff; /* Цвет заголовка */
    padding: 10px;
    background-color: #0D4CD3; /* Темный насыщенный синий цвет */
    border-radius: 0 0 10px 10px; /*Закругление углов заголовка */
    box-shadow: 0 2px 10px rgba(0, 0, 0, 0.2); /* Тень для заголовка */
  }

  .measure {
    border-radius: 10px; /* Закругленные углы карточек */
    overflow: hidden; /* Скрывать переполнение */
    background-color: #ffffff; /* Белый фон для карточек */
    box-shadow: 0 4px 12px rgba(0, 0, 0, 0.1); /* Тень для карточек */
    transition: transform 0.3s; /* Плавный эффект при изменении масштаба */
    position: relative; /* Для абсолютного позиционирования заголовка */
    padding: 15px; /* Внутренние отступы карточки */
    text-align: center; /* Выравнивание текста по центру */
    border: 1px solid #e0e0e0; /* Легкая граница вокруг карточек */
  }

  .measure:hover {
    transform: scale(1.05); /* Увеличение карточки при наведении */
  }

  img {
    width: 100%; /* Растягиваем на всю ширину контейнера */
    height: 200px; /* Автоматическая высота с сохранением пропорций */
    max-height: 180px; /* Максимальная высота изображения */
    object-fit: cover; /* Обрезка изображения для заполнения блока */
    border-bottom: 4px solid #0D4CD3; /* Цветовая граница снизу изображения */
    transition: filter 0.3s; /* Плавный переход между эффектами */
  }

  .measure:hover img {
    filter: brightness(70%); /* Затемнение изображения при наведении */
  }

  .measure h2 {
    margin-top: 10px; /* Отступ сверху заголовка */
    margin-bottom: 10px; /* Отступ снизу заголовка */
    font-size: 1.4em; /* Размер шрифта заголовка */
    color: #0D4CD3; /* Цвет текста заголовка */
    font-weight: bold; /* Полужирный текст */
    text-shadow: 1px 1px 3px rgba(0, 0, 0, 0.2); /* Тень для текста заголовка */
  }

  .measure p {
    font-size: 0.95em; /* Размер шрифта для описания */
    color: #555; /* Цвет текста описания */
    line-height: 1.5; /* Высота строки для лучшей читаемости */
    margin: 0; /* Убираем отступы */
  }
</style>
