<script>
	// Создаем массив с федеральными мерами поддержки и их краткими описаниями.
	const measures = [
		{
			title: 'Налоговые льготы: ставка в размере 0% при применении УСН на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере установлена ставка (0%) по упрощенной системе налогообложения. Основание: Закон ХМАО - Югры от 20.02.2015 № 14-оз 'Об установлении на территории Ханты-Мансийского автономного округа - Югры налоговой ставки в размере 0 процентов по упрощенной системе налогообложения и патентной системе налогообложения'."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 1% при применении УСН с объектом налогообложения доходы на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере на 2022-2024 годы установлена пониженная ставка (1%) по упрощенной системе налогообложения с объектом налогообложения 'доходы' для субъектов малого предпринимательства и индивидуальных предпринимателей. Основание: Закон ХМАО - Югры от 30.12.2008 № 166-оз 'О ставках налога, уплачиваемого в связи с применением упрощенной системы налогообложения'."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 4% при применении УСН с объектом налогообложения доходы на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере на 2023-2024 годы установлена пониженная ставка (4%) по упрощенной системе налогообложения с объектом налогообложения 'доходы' для субъектов малого предпринимательства и индивидуальных предпринимателей. Основание: Закон ХМАО - Югры от 30.12.2008 № 166-оз 'О ставках налога, уплачиваемого в связи с применением упрощенной системы налогообложения'."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 0% при применении патентной системы налогообложения на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы в IT-сфере установлена ставка (0%) ппри применении патентной системы налогообложения. Основание: Закон ХМАО - Югры от 20.02.2015 № 14-оз 'Об установлении на территории Ханты-Мансийского автономного округа - Югры налоговой ставки в размере 0 процентов по упрощенной системе налогообложения и патентной системе налогообложения'."
		},
		{
			title:
				'Налоговые льготы: ставка в размере 5% при применении УСН с объектом налогообложения доходы, уменьшенные на величину расходов, на территории ХМАО – Югры',
			description:
				"В целях развития предпринимательской инициативы на 2019-2024 годы установлена пониженная ставка (5%) по упрощенной системе налогообложения с объектом налогообложения «доходы, уменьшенные на величину расходов» для субъектов малого предпринимательства и индивидуальных предпринимателей. Основание: Закон ХМАО - Югры от 30.12.2008 № 166-оз 'О ставках налога, уплачиваемого в связи с применением упрощенной системы налогообложения'."
		},
		{
			title:
				'Предоставление социальных выплат отдельным категориям граждан на обеспечение жилыми помещениями в ХМАО – Югре',
			description:
				'Социальные выплаты предоставляются работникам организаций, являющихся субъектами малого и среднего предпринимательства, или индивидуальным предпринимателям, зарегистрированным в автономном округе, осуществляющим деятельность в области информационных технологий, компьютерного программного обеспечения и (или) участвующим в реализации проекта «Цифровая платформа Югры» по направлениям: медицина, жилищно-коммунальное хозяйство, государственное управление, создание искусственного интеллекта, а также медицинским работникам медицинских организаций первичного звена здравоохранения и скорой медицинской помощи, медицинским работникам организаций социального обслуживания, научным работникам научных организаций и организаций высшего образования, работникам организаций высшего образования из числа профессорско-преподавательского состава, имеющим ученую степень кандидата и (или) доктора наук. Основание: постановление Правительства ХМАО – Югры от 29.12.2020 г. № 643-п «О мерах по реализации Государственной программы Ханты-Мансийского автономного округа - Югры «Строительство».'
		},
		{
			title: 'Инвестиционный налоговый вычет',
			description:
				"Введен инвестиционный налоговый вычет в размере 70% для телекоммуникационных компаний.  Таким образом им вернут часть налога на прибыль. Это поможет сохранить качество связи, не привлекая дополнительного финансирования, а также сохранит инвестиции операторов в эксплуатацию и модернизацию сетей связи. Основание: Закон ХМАО – Югры от 30.09.2011 № 87-оз 'О налоге на прибыль организаций, подлежащем зачислению в бюджет Ханты-Мансийского автономного округа - Югры'."
		},
		{
			title: 'Снижение ставки арендной платы',
			description:
				"В 2 раза снижена ставка арендной платы по договорам аренды имущества, находящегося в государственной собственности автономного округа для объектов связи и центров обработки данных. Основание: постановление Правительства ХМАО – Югры от 27.11.2017 № 466-п в редакции от 12.08.2022 'О порядке предоставления в аренду имущества, находящегося в государственной собственности Ханты-Мансийского автономного округа - Югры, порядке согласования предоставления в аренду имущества, закрепленного за государственными учреждениями Ханты-Мансийского автономного округа - Югры на праве оперативного управления'."
		},
		{
			title: 'Сумма налога на имущество уменьшается на 50%',
			description:
				"Сумма налога на имущество уменьшается на 50% для организаций, осуществляющих деятельность в области информационных технологий, начиная с отчетного периода получения документа о государственной аккредитации организации, осуществляющей деятельность в области информационных технологий, в отношении объектов связи и центров обработки данных. Основание: Закон ХМАО - Югры от 29.11.2010 N 190-оз 'О налоге на имущество организаций'."
		},
		{
			title: 'Конкурс на получение Грантов Губернатора ХМАО – Югры',
			description:
				"Ежегодно проводится конкурс на получение грантов Губернатора Ханты-Мансийского автономного округа – Югры на развитие гражданского общества и реализацию проектов в области культуры, искусства и креативных индустрий в направлении проектов в сфере ИКТ. Основание: постановление Губернатора ХМАО – Югры от 31.10.2018 № 108 'О грантах Губернатора Ханты-Мансийского автономного округа - Югры на развитие гражданского общества и реализацию проектов в области культуры, искусства и креативных индустрий'."
		}
	];
</script>

<div class="container">
	<h1>Региональные меры поддержки в сфере IT</h1>
	{#each measures as measure}
		<div class="measure">
			<h2>{measure.title}</h2>
			<p>{measure.description}</p>
		</div>
	{/each}
</div>

<style>
	.container {
        padding: 20px;
    }

	h1 {
		text-align: center;
		margin-bottom: 30px;
	}

	.measure {
		border: 1px solid #ccc;
		border-radius: 8px;
		padding: 15px;
		margin: 15px 0;
		display: flex;
		flex-direction: column;
		align-items: center;
		justify-content: center;
	}

	.measure img {
		width: 100%;
		max-width: 300px; /* Ограничиваем ширину изображения */
		border-radius: 8px;
		margin-bottom: 10px;
	}

	.measure h2 {
		margin: 10px 0;
		font-size: 1.5em;
		text-align: center;
	}

	.measure p {
		text-align: center;
		color: #555;
	}
</style>
